// К - ичные числа.Среди чисел в системе счисления с основанием K(2≤K≤10) определить сколько 
// имеется чисел из N(1 < N < 20, N + K < 26) разрядов таких, что в их записи содержится более 
// трех подряд идущих нулей.Для того, чтобы избежать переполнения, ответ представьте в виде 
// вещественного числа.

#include "Header.h"
#include <iostream>

// using namespace std; FIX_MEOW: использование глобального пространства имён

// FIX_MEOW: неправильное расположение фигурных скобок

// FIX_MEOW: реализация кода в функции main

int main()
{
    setlocale(LC_ALL, "Russian");

    SolveKBaseTask();

    return 0;
}